{
  "files": [
    "CHANGELOG.md",
    "CMakeLists.txt",
    "PATCH_MANIFEST.json",
    "README.md",
    "SETTINGS.md",
    "game.hpp",
    "game_loop.cpp",
    "main.cpp",
    "render.cpp",
    "docs/PARTICLES.md",
    "docs/ANIMATION.md",
    "docs/SETTINGS.md",
    "src/ai.cpp",
    "src/combat.cpp",
    "src/combat_rules.cpp",
    "src/content.cpp",
    "src/corridor_braid.cpp",
    "src/corridor_braid.hpp",
    "src/dungeon.cpp",
    "src/dungeon.hpp",
    "src/effects.hpp",
    "src/game.cpp",
    "src/game.hpp",
    "src/game_automove.cpp",
    "src/game_interact.cpp",
    "src/game_internal.hpp",
    "src/game_inventory.cpp",
    "src/game_look.cpp",
    "src/game_loop.cpp",
    "src/game_markers.cpp",
    "src/game_save.cpp",
    "src/game_spawn.cpp",
    "src/game_spellcasting.cpp",
    "src/game_targeting.cpp",
    "src/game_world.cpp",
    "src/hallucination.hpp",
    "src/headless_main.cpp",
    "src/items.cpp",
    "src/items.hpp",
    "src/keybinds.cpp",
    "src/main.cpp",
    "src/mesh2d.cpp",
    "src/mesh2d.hpp",
    "src/render.cpp",
    "src/render.hpp",
    "src/replay_runner.cpp",
    "src/replay_runner.hpp",
    "src/settings.cpp",
    "src/settings.hpp",
    "src/shop.cpp",
    "src/spells.cpp",
    "src/spells.hpp",
    "src/spritegen.cpp",
    "src/spritegen.hpp",
    "src/spritegen3d.cpp",
    "src/spritegen3d.hpp",
    "src/terrain_sculpt.cpp",
    "src/terrain_sculpt.hpp",
    "src/ui_font.hpp",
    "tests/test_main.cpp"
  ],
  "patch_id": "roundN_plus131_patch",
  "previous_patch": "roundN_plus130_patch",
  "summary": [
    "Added mesh-based isometric voxel sprite rendering: in isometric view mode, voxel_sprites now project visible voxel faces into a 2D triangle mesh and rasterize to a sprite for better alignment with the 2.5D terrain.",
    "Added a reusable procedural 2D mesh rasterizer (Mesh2D) with an opaque z-buffer pass plus depth-sorted translucent blending; isometric voxel sprites now greedy-merge uniform visible faces for fewer triangles and more robust glass/liquid ordering.",
    "Added an optional perf overlay HUD (FPS/frame time, sprite cache usage/hits/misses/evictions, and a low-rate determinism hash) toggleable via Shift+F10 (default), `show_perf_overlay` setting, or `#perf on/off`.",
    "Obscure debug/info commands: added extended commands #pos (#where alias), #what (#tile/#describe/#whatis aliases), and #mapstats for quick coordinate readout, tile description, and per-floor exploration stats (uses LOOK cursor when active or accepts X Y).",
    "Procedurally generated map sizes: newly generated floors now vary in width/height by depth (with mild jitter). Special/bespoke floors keep the canonical size.",
    "Auto-explore/pathfinding indexing and mouse->tile hit testing now use the current dungeon dimensions (no fixed MAP_W/H assumptions).",
    "Level entry messaging now reports `LEVEL SIZE: WxH` when a floor is generated for the first time (and at game start).",
    "Improved procedurally generated isometric visuals: themed floor tiles in isometric view are now generated directly in diamond space (no projection), keeping material patterns aligned to the 2:1 grid and reducing projection artifacts.",
    "Improved procedurally generated isometric visuals: wall/door/doorway 2.5D block sprites now add subtle procedural brick/mortar seams on stone faces and non-animated wood grain streaks on door panels, reducing flatness and improving material readability.",
    "Fixed isometric asset generation: repaired a loop ordering regression in isometric terrain overlay creation (edge shade + chasm gloom) that could break compilation and/or prevent overlays from generating correctly.",
    "Improved procedurally generated isometric visuals: floor tiles adjacent to chasms now draw an additional procedural diamond 'gloom' overlay that darkens farther inward than the rim band, making pits read deeper and edges more hazardous in 2.5D view.",
    "Improved procedurally generated isometric visuals: confusion/poison gas and fire field overlays in isometric view are now generated directly in diamond space (no projection), keeping animation aligned to the 2:1 grid; poison gas now also uses the isometric overlay textures.",
    "Improved procedurally generated isometric visuals: themed floor decal overlays in isometric view are now generated directly in diamond space (no projection), keeping thin linework crisper and motifs better aligned to the 2.5D grid.",
    "Improved procedurally generated isometric visuals: chasms in isometric view now use a purpose-built procedural diamond tile (stone rim + shaded inner walls + swirling void core) for stronger depth cues, replacing the projected top-down chasm tile.",
    "Improved procedurally generated isometric block sprites: wall/door/doorway/pillar blocks now get subtle vertical-face ambient occlusion (under-cap, ridge seam, and base grounding) plus a light-facing cap rim highlight for stronger 2.5D volume and readability.",
    "Improved procedurally generated isometric visuals: isometric diamond terrain tiles now get a subtle whole-tile directional light ramp for better 2.5D depth, and isometric cast shadows now use a two-stage penumbra + stronger inner-corner occlusion, with per-caster-type strength scaling in the renderer.",
    "Improved procedurally generated visuals: voxel sprite renderer now uses hemisphere-based ambient occlusion sampling (reduces over-darkening on flat surfaces while deepening concave pockets) and stamps a softer multi-tap contact shadow to better ground 3D voxel sprites.",
    "Improved procedurally generated visuals: confusion/poison gas and fire overlays now use domain-warped fBm masks for more wispy, swirling motion with less blobby silhouettes; fire adds subtle spark highlights while retaining ordered dithering for crisp pixel-art.",
    "Improved top-down procedurally generated visuals: added subtle wall contact shadows (ambient occlusion) on floor tiles adjacent to occluders (walls/closed doors/pillars + boulders/fountains/altars), using procedural mask+variant overlays to avoid repetition.",
    "Improved procedurally generated visuals: coherent (low-frequency) tile variant selection for floors/walls/chasms, plus more even decal/stain placement (top-down + isometric).",
    "Monster AI pathing now avoids poison gas clouds and discovered traps when practical (hazard-aware routing).",
    "Added Ring of Sustenance: slows hunger loss while worn (only when hunger is enabled), with enchant/bless increasing potency.",
    "Auto-travel now prefers trap-free routes when possible, falling back to paths that may approach known traps.",
    "Rest command now recovers mana as well as HP (it no longer refuses to rest just because HP is full).",
    "Rest now stops early on visible danger, damage ticks (e.g., poison), or starvation to prevent accidental self-kills.",
    "Added Scroll of Enchant Ring: enchants a ring in your inventory (+ENCHANT), prompting you to choose if multiple rings are available.",
    "Keybind parsing now deduplicates equivalent chords (e.g. `?` vs `shift+slash`) so bindings don't show duplicates / “double up”.",
    "Keybinds editor overlay: added / filter search with a safer typing mode (Enter/Esc exits), DEL unbind (writes `none`), and highlighted conflicts when the same chord is bound to multiple actions.",
    "HUD text now wraps (stats, message log, and bottom hint lines) instead of clipping off the right edge on narrow windows.",
    "Extended command prompt: TAB completion now expands to the longest common prefix and lets you cycle through multiple matches by pressing TAB repeatedly.",
    "Extended command prompt: autocomplete also works for pasted NetHack-style inputs like `#quit`.",
    "Message history overlay: PageUp/PageDown now pages through results (10 lines) and search matches are highlighted.",
    "Mouse wheel scrolling is now context-sensitive in UI overlays: it scrolls selection in list menus (inventory/chests/spells/options/codex/discoveries/scores) and allows the minimap’s intended quick-scroll (LOG UP/DOWN) to move the cursor by 10 tiles instead of scrolling the message log.",
    "Auto-travel now allows targeting locked doors directly when you have keys/lockpicks (useful for walking to vault doors intentionally).",
    "Auto-explore frontier selection now respects diagonal corner-cutting rules, avoiding unreachable diagonal targets that could prematurely end exploration.",
    "Procedural particle VFX engine: renderer-owned, procedurally generated spark/smoke/ember textures with lightweight simulation; integrated for hits, explosions, fire-field embers, and projectile trails.",
    "Game-driven procedural particle FX events for spells + digging via new FXParticleEvent queue; renderer consumes events into the particle engine.",
    "Documented particle/VFX pipeline in docs/PARTICLES.md.",
    "Isometric voxel sprites: upgraded mesh-projected voxel face shading to use a consistent directional light (ambient + diffuse) plus cheap AO and a subtle spec/rim boost; shading multipliers are quantized so greedy face merges remain stable and clean.",
    "Added optional isometric voxel sprite raytracing: new `iso_voxel_raytrace` setting (and `#isoraytrace` toggle) switches isometric voxel sprites from the mesh rasterizer to a custom orthographic DDA voxel raytracer with soft self-shadowing + AO.",
    "Save/load recovery: loading a save/autosave now automatically falls back to rotated backup files (.bak1..bak10) when the primary file is corrupt/truncated/CRC mismatched, improving crash resilience.",
    "Input handling: SDL key repeat is now honored for movement and menu navigation (hold keys to repeat); repeats are suppressed for ESC/confirm/toggle actions to avoid accidental spam.",
    "Auto-explore: when no normal frontiers remain, it will now walk to reachable locked doors that border unexplored tiles (if you have keys/lockpicks) so it doesn't incorrectly report the floor as fully explored.",
    "Help overlay now wraps long lines and supports scrolling (Up/Down, PageUp/PageDown, mouse wheel) so content never clips off-screen; message history wheel now scrolls via Up/Down so PageUp/PageDown can page 10 lines.",
    "Procedural sprite animation: renderer-side smooth move tween (with hop/squash), idle bob, recoil on damage, floating item bob + iso shadow, and projectile lerp + arc."
  ],
  "timestamp": "2026-01-13T00:00:00Z",
  "notes": "RoundN+129: Help overlay now wraps and is scrollable (Up/Down, PageUp/PageDown, mouse wheel) so it doesn't clip on small windows; message history wheel uses Up/Down so PageUp/PageDown can page 10 lines as documented.",
  "cumulative_patch_id": "roundN_plus123_patch",
  "applied_patches": [
    {
      "id": "roundN_plus94",
      "timestamp": "2026-01-10T11:35:00Z",
      "notes": [
        "Auto-travel now prefers routes that avoid already-discovered traps when possible.",
        "If no trap-free route exists, it falls back to a route that may approach known traps (auto-move still refuses to step onto a known trap)."
      ],
      "files": [
        "src/game_automove.cpp",
        "PATCH_MANIFEST.json"
      ]
    },
    {
      "id": "roundN_plus95",
      "timestamp": "2026-01-10T12:05:00Z",
      "notes": [
        "Rest command now supports recovering mana (in addition to HP) and no longer refuses to rest just because HP is full.",
        "Rest now stops early on danger/damage/starvation to prevent accidental self-kills (e.g. poison ticking while resting)."
      ],
      "files": [
        "src/game_look.cpp",
        "PATCH_MANIFEST.json"
      ]
    },
    {
      "id": "roundN_plus96",
      "timestamp": "2026-01-10T12:41:33Z",
      "notes": [
        "Added a new identifiable ring: Ring of Sustenance. While worn (and hunger enabled), it slows hunger loss deterministically.",
        "Ring of Sustenance appears in treasure-room loot, trapped chests, and magic shop ring rolls; sprites + discovery blurbs updated."
      ],
      "files": [
        "CHANGELOG.md",
        "PATCH_MANIFEST.json",
        "src/game_internal.hpp",
        "src/game_inventory.cpp",
        "src/game_spawn.cpp",
        "src/items.cpp",
        "src/items.hpp",
        "src/render.cpp",
        "src/spritegen.cpp",
        "src/spritegen3d.cpp"
      ]
    },
    {
      "id": "roundN_plus97",
      "timestamp": "2026-01-10T13:05:00Z",
      "notes": [
        "Monster AI now treats poison gas tiles and discovered traps as higher-cost during pathfinding, routing around known hazards when possible."
      ],
      "files": [
        "src/ai.cpp",
        "CHANGELOG.md",
        "PATCH_MANIFEST.json"
      ]
    },
    {
      "id": "roundN_plus98",
      "timestamp": "2026-01-10T13:55:00Z",
      "notes": [
        "Tile variant selection for floors/walls/chasms now uses low-frequency coherent noise to form natural-looking patches.",
        "Floor decals now use jittered-grid placement to reduce clumping; wall stains avoid adjacent clusters.",
        "Isometric wall blocks now pick variants coherently along wall segments."
      ],
      "files": [
        "src/render.cpp",
        "CHANGELOG.md",
        "PATCH_MANIFEST.json"
      ]
    },
    {
      "id": "roundN_plus99",
      "timestamp": "2026-01-10T14:35:00Z",
      "notes": [
        "Added a procedurally generated top-down contact shadow (ambient occlusion) overlay for floor tiles adjacent to nearby occluders (walls/closed doors/pillars + boulders/fountains/altars).",
        "Overlay is mask-driven (4-neighbor) with a small variant set to reduce repetition; rendered subtly so it doesn't overpower decals."
      ],
      "files": [
        "src/render.cpp",
        "src/render.hpp",
        "src/spritegen.cpp",
        "src/spritegen.hpp",
        "CHANGELOG.md",
        "PATCH_MANIFEST.json"
      ]
    },
    {
      "id": "roundN_plus100",
      "timestamp": "2026-01-10T19:40:17Z",
      "notes": [
        "Improved procedural VFX overlays: confusion/poison gas now uses domain-warped fBm for wispy swirling motion (less blob-like).",
        "Fire overlay now uses rising turbulence + cutout gaps + subtle spark highlights for a more natural flicker while staying crisp via ordered dithering."
      ],
      "files": [
        "src/spritegen.cpp",
        "CHANGELOG.md",
        "PATCH_MANIFEST.json"
      ]
    },
    {
      "id": "roundN_plus101",
      "timestamp": "2026-01-10T20:42:40Z",
      "notes": [
        "Voxel sprite ambient occlusion is now hemisphere-sampled (normal-oriented), keeping broad exposed faces from being over-darkened while still deepening concave pockets/creases.",
        "Voxel sprites now stamp a softer multi-tap contact shadow (short falloff chain) for better grounding and readability."
      ],
      "files": [
        "src/spritegen3d.cpp",
        "CHANGELOG.md",
        "PATCH_MANIFEST.json"
      ]
    },
    {
      "id": "roundN_plus102",
      "timestamp": "2026-01-10T21:11:43Z",
      "notes": [
        "Isometric diamond terrain tiles now apply a subtle whole-tile directional light ramp (top-left brighter / bottom-right darker) to better sell the 2.5D ground plane.",
        "Isometric cast shadow overlay now uses a two-stage penumbra and stronger inner-corner occlusion for grounded corridors.",
        "Renderer now scales isometric cast shadow strength by occluder type (walls/closed doors cast stronger shadows than props like altars/fountains)."
      ],
      "files": [
        "src/spritegen.cpp",
        "src/render.cpp",
        "CHANGELOG.md",
        "PATCH_MANIFEST.json"
      ]
    },
    {
      "id": "roundN_plus103",
      "timestamp": "2026-01-10T21:44:18Z",
      "notes": [
        "Isometric wall/door/doorway/pillar block sprites now add subtle vertical-face ambient occlusion (under-cap overhang, ridge seam, base grounding) plus a light-facing cap rim highlight, improving 2.5D volume and readability."
      ],
      "files": [
        "src/spritegen.cpp",
        "CHANGELOG.md",
        "PATCH_MANIFEST.json"
      ]
    },
    {
      "id": "roundN_plus104",
      "timestamp": "2026-01-10T22:42:15Z",
      "notes": [
        "Isometric chasm tiles now use a purpose-built procedural diamond generator (stone rim + shaded inner walls + swirling void core) to improve depth/readability in 2.5D view.",
        "Renderer now builds chasmVarIso using generateIsometricChasmTile() rather than projecting the top-down chasm sprite."
      ],
      "files": [
        "src/spritegen.hpp",
        "src/spritegen.cpp",
        "src/render.cpp",
        "CHANGELOG.md",
        "PATCH_MANIFEST.json"
      ]
    },
    {
      "id": "roundN_plus105",
      "timestamp": "2026-01-10T23:33:10Z",
      "notes": [
        "Isometric floor decals are now generated directly in diamond space (no projection), keeping thin cracks/runes/grime crisper and better aligned to the 2.5D grid."
      ],
      "files": [
        "src/spritegen.hpp",
        "src/spritegen.cpp",
        "src/render.cpp",
        "CHANGELOG.md",
        "PATCH_MANIFEST.json"
      ]
    },
    {
      "id": "roundN_plus106",
      "timestamp": "2026-01-11T02:39:04Z",
      "notes": [
        "Isometric gas and fire field overlays are now generated directly in diamond space (no projection) so they align cleanly to the 2:1 isometric grid.",
        "Poison gas rendering now uses the isometric overlay textures in ViewMode::Isometric."
      ],
      "files": [
        "src/spritegen.hpp",
        "src/spritegen.cpp",
        "src/render.cpp",
        "CHANGELOG.md",
        "PATCH_MANIFEST.json"
      ]
    },
    {
      "id": "roundN_plus107",
      "timestamp": "2026-01-11T04:47:35Z",
      "notes": [
        "Isometric view: floor tiles adjacent to chasms now receive an additional inward 'gloom' darkening overlay (beyond the rim band) so pits read deeper and edges feel more dangerous."
      ],
      "files": [
        "src/spritegen.hpp",
        "src/spritegen.cpp",
        "src/render.hpp",
        "src/render.cpp",
        "CHANGELOG.md",
        "PATCH_MANIFEST.json"
      ]
    },
    {
      "id": "roundN_plus108",
      "timestamp": "2026-01-11T05:29:35Z",
      "notes": [
        "Isometric 2.5D block sprites (walls/doors/doorways) now add subtle procedural brick/mortar seams on stone faces and wood grain streaks on door panels for richer, less-flat materials.",
        "Fixed a regression in isometric terrain overlay creation (edge shade + chasm gloom) that could break compilation and/or prevent overlays from generating correctly."
      ],
      "files": [
        "src/spritegen.cpp",
        "src/render.cpp",
        "CHANGELOG.md",
        "PATCH_MANIFEST.json"
      ]
    },
    {
      "patch_id": "roundN_plus109",
      "timestamp": "2026-01-11T01:21:46Z",
      "note": "Procedural isometric base tiles: add rock density noise, quantized heightmap + improved shading, per-tile sprite hashing; cleanup/refactor.",
      "files": [
        "src/spritegen.cpp",
        "src/spritegen.hpp",
        "src/render.cpp",
        "CHANGELOG.md",
        "PATCH_MANIFEST.json"
      ]
    },
    {
      "patch_id": "roundN_plus110",
      "timestamp": "2026-01-11T09:22:21Z",
      "note": "Procedural map sizes (variable width/height per newly generated floor) + dynamic-dimension updates for auto-explore/pathing and mouse hit-testing; report LEVEL SIZE on first generation.",
      "files": [
        "src/game.cpp",
        "src/game.hpp",
        "src/game_automove.cpp",
        "src/game_look.cpp",
        "src/game_targeting.cpp",
        "src/game_loop.cpp",
        "src/game_save.cpp",
        "src/render.cpp",
        "src/render.hpp",
        "src/main.cpp",
        "CHANGELOG.md",
        "PATCH_MANIFEST.json"
      ]
    },
    {
      "id": "roundN_plus111",
      "timestamp": "2026-01-11T09:54:18Z",
      "notes": [
        "Added new extended commands for info/debug: #pos/#where (coordinates + depth + level size), #what/#tile/#describe/#whatis (tile description), and #mapstats (per-floor quick stats). Commands use the LOOK cursor when active or accept explicit X Y."
      ],
      "files": [
        "CHANGELOG.md",
        "src/game_internal.hpp",
        "PATCH_MANIFEST.json"
      ]
    },
    {
      "id": "roundN_plus112",
      "timestamp": "2026-01-11T10:22:53Z",
      "notes": [
        "Added a tiny optional performance overlay HUD (FPS/frame time, sprite-cache stats, low-rate determinism hash).",
        "Toggle via Shift+F10 (default keybind), `show_perf_overlay` in settings, or `#perf on/off`."
      ],
      "files": [
        "src/game.hpp",
        "src/game_loop.cpp",
        "src/game_internal.hpp",
        "src/keybinds.cpp",
        "src/main.cpp",
        "src/render.hpp",
        "src/render.cpp",
        "src/settings.hpp",
        "src/settings.cpp",
        "docs/SETTINGS.md",
        "README.md",
        "CHANGELOG.md",
        "PATCH_MANIFEST.json"
      ]
    },
    {
      "id": "roundN_plus113",
      "timestamp": "2026-01-11T00:00:00Z",
      "notes": [
        "Added a new identifiable scroll: Scroll of Enchant Ring. Reading it enchants a ring in your inventory (+ENCHANT).",
        "If multiple rings are available, the game prompts you to select one (Enter=choose, Esc=random). Spawn tables + UI + sprite updated."
      ],
      "files": [
        "CHANGELOG.md",
        "README.md",
        "PATCH_MANIFEST.json",
        "src/game.hpp",
        "src/game.cpp",
        "src/game_interact.cpp",
        "src/game_inventory.cpp",
        "src/game_loop.cpp",
        "src/game_save.cpp",
        "src/game_spellcasting.cpp",
        "src/game_spawn.cpp",
        "src/game_internal.hpp",
        "src/items.hpp",
        "src/items.cpp",
        "src/render.cpp",
        "src/spritegen.cpp"
      ]
    },
    {
      "id": "roundN_plus114",
      "timestamp": "2026-01-12T00:00:00Z",
      "notes": [
        "Deduped equivalent keybind chords when parsing bind_* lists (e.g., `?` and `shift+slash`) so the UI/`#binds` output doesn't show duplicates.",
        "HUD text now word-wraps (stats line, message log, and bottom control hints) to prevent clipping off the right edge on narrow windows."
      ],
      "files": [
        "CHANGELOG.md",
        "PATCH_MANIFEST.json",
        "src/keybinds.cpp",
        "src/render.cpp"
      ]
    },
    {
      "id": "roundN_plus115",
      "timestamp": "2026-01-12T00:00:00Z",
      "notes": [
        "Extended command prompt TAB completion now expands to the longest common prefix and supports cycling through multiple matches via repeated TAB presses.",
        "Autocomplete now also works for pasted NetHack-style inputs like `#quit`."
      ],
      "files": [
        "src/game.hpp",
        "src/game_save.cpp",
        "src/game_loop.cpp",
        "CHANGELOG.md",
        "PATCH_MANIFEST.json"
      ]
    },
    {
      "id": "roundN_plus116",
      "timestamp": "2026-01-12T00:00:00Z",
      "notes": [
        "Message history overlay now supports PageUp/PageDown paging (10 lines) and highlights search matches."
      ],
      "files": [
        "src/game_loop.cpp",
        "src/render.cpp",
        "CHANGELOG.md",
        "PATCH_MANIFEST.json"
      ]
    },
    {
      "id": "roundN_plus120",
      "timestamp": "2026-01-12T00:00:00Z",
      "notes": [
        "Added Game-side FXParticleEvent queue and hooked up spells/digging to emit procedural particles (heal/buff/invisibility/blink/poison/dig/detect).",
        "Renderer now consumes fxParticles() events to spawn matching particle bursts over the event lifetime.",
        "Documented the particle/VFX pipeline and FXParticleEvent presets."
      ],
      "files": [
        "src/game.hpp",
        "src/game.cpp",
        "src/game_loop.cpp",
        "src/game_spellcasting.cpp",
        "src/game_targeting.cpp",
        "src/game_interact.cpp",
        "src/render.cpp",
        "CHANGELOG.md",
        "PATCH_MANIFEST.json",
        "docs/PARTICLES.md"
      ]
    },
    {
      "id": "roundN_plus121",
      "timestamp": "2026-01-12T00:00:00Z",
      "notes": [
        "Implemented an isometric voxel sprite renderer (visible-face meshing -> 2D triangles -> rasterization) and wired it into the voxel_sprites pipeline when ViewMode::Isometric is active.",
        "Updated sprite cache keys so isometric voxel sprites can coexist with top-down voxel sprites without requiring cache flushes."
      ],
      "files": [
        "src/spritegen3d.hpp",
        "src/spritegen3d.cpp",
        "src/spritegen.hpp",
        "src/spritegen.cpp",
        "src/render.cpp",
        "docs/SETTINGS.md",
        "CHANGELOG.md",
        "PATCH_MANIFEST.json"
      ]
    },
    {
      "id": "roundN_plus122",
      "timestamp": "2026-01-12T00:00:00Z",
      "notes": [
        "Added a tiny reusable procedural 2D mesh module (Mesh2D): triangle list + z-buffered rasterizer with a split opaque/translucent pipeline.",
        "Isometric voxel sprites now greedy-merge uniform visible faces and render via Mesh2D for fewer triangles and more robust translucent voxel ordering (e.g., glass/liquid)."
      ],
      "files": [
        "src/mesh2d.hpp",
        "src/mesh2d.cpp",
        "src/spritegen3d.cpp",
        "CMakeLists.txt",
        "CHANGELOG.md",
        "PATCH_MANIFEST.json"
      ]
    },
    {
      "id": "roundN_plus123",
      "timestamp": "2026-01-12T00:00:00Z",
      "notes": [
        "Keybinds editor overlay now supports / filter/search with a text-input mode (Enter/Esc exits typing).",
        "DEL unbinds/disables the selected action (writes `bind_<action> = none`).",
        "Conflicting bindings (duplicate chords bound to multiple actions) are highlighted in the list."
      ],
      "files": [
        "src/game.hpp",
        "src/game_loop.cpp",
        "src/main.cpp",
        "src/render.cpp",
        "docs/SETTINGS.md",
        "CHANGELOG.md",
        "PATCH_MANIFEST.json"
      ]
    },
    {
      "id": "roundN_plus124",
      "timestamp": "2026-01-12T00:00:00Z",
      "notes": [
        "Message history overlay now wraps long messages into multiple lines instead of truncating them at the right edge.",
        "Added CTRL+C in the message history overlay to copy the currently filtered history (respects filter/search) to the system clipboard."
      ],
      "files": [
        "src/game.hpp",
        "src/game.cpp",
        "src/main.cpp",
        "src/render.cpp",
        "CHANGELOG.md",
        "PATCH_MANIFEST.json"
      ]
    },
    {
      "id": "roundN_plus125",
      "timestamp": "2026-01-13T00:00:00Z",
      "notes": [
        "Improved isometric voxel sprite lighting/shading (per-face directional diffuse + cheap AO + subtle spec/rim) so voxel_sprites read with more depth/volume in 2.5D view; shading remains quantized to keep greedy face merges stable.",
        "Updated cumulative patch manifest/changelog."
      ],
      "files": [
        "src/spritegen3d.cpp",
        "CHANGELOG.md",
        "PATCH_MANIFEST.json"
      ]
    },
    {
      "id": "roundN_plus126",
      "timestamp": "2026-01-13T00:00:00Z",
      "notes": [
        "Save loading now automatically attempts rotated backups (.bak1..bak10) when the primary save/autosave is missing/corrupt/truncated/CRC mismatched.",
        "In-game load actions and extended #load/#loadauto now use the same backup recovery path.",
        "Documented the behavior in SETTINGS.md."
      ],
      "files": [
        "src/game.hpp",
        "src/game_save.cpp",
        "src/game_loop.cpp",
        "src/game_internal.hpp",
        "src/main.cpp",
        "game.hpp",
        "game_loop.cpp",
        "main.cpp",
        "SETTINGS.md",
        "docs/SETTINGS.md",
        "CHANGELOG.md",
        "PATCH_MANIFEST.json"
      ]
    }
  ],
  "user_instruction": "Procedurally generated custom animation",
  "patch_history": [
    {
      "id": "roundN_plus127",
      "timestamp": "2026-01-13T00:00:00Z",
      "notes": [
        "Keyboard input now honors SDL key repeat for movement and menu navigation (hold directions/arrows/PageUp/PageDown).",
        "Repeat events are still ignored for ESC/Enter/toggle-style actions to prevent accidental spam (and preserve double-ESC quit semantics)."
      ],
      "files": [
        "src/main.cpp",
        "main.cpp",
        "CHANGELOG.md",
        "PATCH_MANIFEST.json"
      ]
    },
    {
      "id": "roundN_plus128",
      "timestamp": "2026-01-13T00:00:00Z",
      "notes": [
        "Auto-explore: when no normal frontiers remain, it will now walk to reachable locked doors that border unexplored tiles (if you have keys/lockpicks) so it doesn't incorrectly report the floor as fully explored."
      ],
      "files": [
        "src/game_automove.cpp",
        "CHANGELOG.md",
        "PATCH_MANIFEST.json"
      ]
    },
    {
      "id": "roundN_plus130",
      "timestamp": "2026-01-13T00:00:00Z",
      "notes": [
        "Added an optional orthographic isometric voxel raytracer (DDA traversal) for voxel_sprites in isometric view.",
        "New setting: `iso_voxel_raytrace` (default false).",
        "New extended command: `#isoraytrace on/off/toggle` (clears sprite cache so textures regenerate).",
        "Sprite cache keys now include a raytrace bit so mesh vs raytraced isometric sprites never collide."
      ],
      "files": [
        "src/spritegen3d.cpp",
        "src/spritegen3d.hpp",
        "src/spritegen.cpp",
        "src/spritegen.hpp",
        "src/render.cpp",
        "src/render.hpp",
        "src/settings.cpp",
        "src/settings.hpp",
        "src/game.hpp",
        "src/game_internal.hpp",
        "src/main.cpp",
        "CHANGELOG.md",
        "SETTINGS.md",
        "docs/SETTINGS.md",
        "PATCH_MANIFEST.json",
        "game.hpp",
        "main.cpp",
        "render.cpp"
      ]
    },
    {
      "id": "roundN_plus131",
      "timestamp": "2026-01-13T05:58:53Z",
      "notes": [
        "Added renderer-side procedural sprite animation: smooth movement tween with hop + squash/stretch, plus idle bob for living entities.",
        "Added quick recoil animation when an entity takes damage (HP decreases).",
        "Items now gently bob; isometric view also draws a small grounding shadow that shrinks/fades as the item rises.",
        "Projectiles now smoothly interpolate between path tiles using stepTimer/stepTime, with a slight arc lift."
      ],
      "files": [
        "src/render.hpp",
        "src/render.cpp",
        "render.cpp",
        "docs/ANIMATION.md",
        "CHANGELOG.md",
        "PATCH_MANIFEST.json"
      ]
    }
  ],
  "generated_at": "2026-01-13T05:58:53Z"
}
